Revit 2027 API
MasonryCMU.MasonryCMUPattern Property
 The property labeled "Relief Pattern" from the "MasonryCMU" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MasonryCMUPattern { get; }
Public Shared ReadOnly Property MasonryCMUPattern As String
	Get
public:
static property String^ MasonryCMUPattern {
	String^ get ();
}
static member MasonryCMUPattern : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".
See Also
Reference
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace